'''
    Вывести все числа от 1 до 100, которые делятся на 3 без остатка.
'''

for num in range(101):
    if num % 3 == 0:
        print(num)